{
  "summary": {
    "headline": "Software Engineer | Optimization & Deep Reinforcement Learning Researcher",
    "body": [
      "I am pursuing a Doctor of Philosophy (PhD) in Computer Science and Technology at Xidian University (XDU), specializing in Deep Reinforcement Learning (DRL) for Financial Systems.",
      "My research focuses on integrating DRL in financial modeling and real-time market adaptation to improve stock trading and portfolio management under non-stationary market conditions.",
      "Alongside research, I build production SaaS systems at Autofficina Internazionale s.a.s, working on customer appointment management, marketing systems, dynamic page building, URL shorteners, and telematics—where performance, reliability, and measurable impact matter."
    ]
  },
  "stories": [
    {
      "id": "neurasynk",
      "title": "Neurasynk – Adaptive Brain Network Neurofeedback via Deep Reinforcement Learning",
      "body": [
        "A real-time, closed-loop neurofeedback system leveraging Deep Reinforcement Learning (DRL) to dynamically modulate brain networks.",
        "It synchronizes EEG-based brain connectivity features with adaptive feedback strategies to deliver personalized cognitive enhancement and non-invasive therapeutic interventions."
      ],
      "href": "/details/neurasynk",
      "images": [
        "EEG neurofeedback system",
        "brain network connectivity visualization",
        "reinforcement learning closed loop diagram"
      ]
    },
    {
      "id": "tipo",
      "title": "End-to-End Technical Indicator Parameter Optimization (Dynamic Approach)",
      "body": [
        "A framework that automates technical indicator parameter optimization and rigorous validation.",
        "Designed to establish a stronger standard for evaluating indicator-based trading strategies with thorough testing across parameters and conditions."
      ],
      "href": "/details/tipo",
      "images": [
        "technical indicators trading chart",
        "backtesting performance metrics",
        "hyperparameter optimization diagram"
      ]
    },
    {
      "id": "siopa",
      "title": "SIOPA – Stock Indicator Optimization and Predictive Analysis",
      "body": [
        "A deep neural network framework to classify and predict optimal stock indicator parameters.",
        "Uses historical data and backtesting metrics (Sharpe ratio, max drawdown) to streamline parameter optimization and improve trading performance."
      ],
      "href": "/projects/siopa",
      "images": [
        "stock indicator optimization",
        "deep neural network architecture",
        "time series forecasting chart"
      ]
    }
  ]
}