{
  "summary": {
    "headline": "Software Engineer | Optimization & Deep Reinforcement Learning Researchar.",
    "body": [
      "I am a doctoral researcher in Biomedical Engineering at Xi’an Jiaotong University (XJTU), where my work focuses on Deep Reinforcement Learning (DRL) for adaptive neurofeedback and optimization in brain–computer interface (BCI) systems. My research investigates how learning agents can operate robustly in non-stationary, noisy, and partially observable neural environments using EEG-based feedback.",
      "In parallel, I actively collaborate with Xidian University (XDU) on my previous research line in Financial Deep Reinforcement Learning, working with my former supervisor on reinforcement learning–based stock trading and portfolio optimization under non-stationary market conditions.",
      "My primary research interests include deep reinforcement learning, adaptive neurofeedback, EEG signal modeling, brain network analysis, stability and overfitting in sequential decision models, risk-aware reward design, and the empirical evaluation of learning agents on real-world physiological and financial time-series data.",
      "Alongside academic research, I work as a Software Engineer at Autofficina Internazionale s.a.s, where I design and maintain production-grade SaaS systems. My work spans customer appointment management, marketing automation, dynamic content generation, URL shorteners, and vehicle telematics—driven by performance, reliability, and measurable business impact."
    ]
  },
  "stories": [
    {
      "id": "neurasynk",
      "title": "Neurasynk – Adaptive Brain Network Neurofeedback via Deep Reinforcement Learning",
      "body": [
        "A real-time, closed-loop neurofeedback system leveraging Deep Reinforcement Learning (DRL) to dynamically modulate brain networks.",
        "It synchronizes EEG-based brain connectivity features with adaptive feedback strategies to deliver personalized cognitive enhancement and non-invasive therapeutic interventions."
      ],
      "href": "/projects"
    },
    {
      "id": "tipo",
      "title": "End-to-End Technical Indicator Parameter Optimization (Dynamic Approach)",
      "body": [
        "A framework that automates technical indicator parameter optimization and rigorous validation.",
        "Designed to establish a stronger standard for evaluating indicator-based trading strategies with thorough testing across parameters and conditions."
      ],
      "href": "/projects"
    },
    {
      "id": "siopa",
      "title": "SIOPA – Stock Indicator Optimization and Predictive Analysis",
      "body": [
        "A deep neural network framework to classify and predict optimal stock indicator parameters.",
        "Uses historical data and backtesting metrics (Sharpe ratio, max drawdown) to streamline parameter optimization and improve trading performance."
      ],
      "href": "/projects"
    }
  ]
}