{
  "id": "as-md-habibullah",
  "avatar": "/avatar.jpg",

  "name": {
    "full": "As Md Habibullah",
    "sidebar": "As Md Habibullah",
    "title": "Software Engineer & PhD Student."
  },

  "headline": "Software Engineer | Optimization & Deep Reinforcement Learning Researcher.",
  "body": [
    "I am a Doctoral Researcher at Xidian University (XDU): Specializing in Deep Reinforcement Learning (DRL) for adaptive systems, focusing on agent robustness in non-stationary and noisy environments.",
    "FinDRL Research Lead: Developing multi-agent frameworks for stock trading and portfolio optimization under dynamic market conditions.",
    "Research Interests: Deep Reinforcement Learning, quantitative time-series analysis, risk-aware reward design, and the empirical evaluation of learning agents.",
    "Senior Software Engineer: Architecting production-grade SaaS systems at Autofficina Internazionale s.a.s, covering telematics, marketing automation, and CRM solutions."
  ],

  "affiliation": {
    "institution": "Xi’an Jiaotong University (XJTU)",
    "department": "PhD Student in Biomedical Engineering",
    "location": "Xi’an, China"
  },

  "contact": {
    "email": "habib@scholariest.com"
  },

  "social": {
    "github": "https://github.com/im-habib",
    "twitter": "https://twitter.com/the_habib",
    "linkedin": "https://www.linkedin.com/in/im-habib",
    "google_scholar": "https://scholar.google.com/citations?hl=en&user=NwSjZScAAAAJ"
  },

  "cv": {
    "pdf": "/resume.pdf"
  },

  "research_interests": [
    "Optimization",
    "EEG Signal Modeling",
    "Adaptive Neurofeedback",
    "Brain Network Analysis",
    "Deep Reinforcement Learning (DRL)",
    "Financial Deep Reinforcement Learning (FinDRL)"
  ],

  "stories": [
    {
      "id": "neurasynk",
      "title": "Neurasynk – Adaptive Brain Network Neurofeedback via Deep Reinforcement Learning",
      "body": [
        "A real-time, closed-loop neurofeedback system leveraging Deep Reinforcement Learning (DRL) to dynamically modulate brain networks.",
        "It synchronizes EEG-based brain connectivity features with adaptive feedback strategies to deliver personalized cognitive enhancement and non-invasive therapeutic interventions."
      ],
      "href": "/projects"
    },
    {
      "id": "tipo",
      "title": "End-to-End Technical Indicator Parameter Optimization (Dynamic Approach)",
      "body": [
        "A framework that automates technical indicator parameter optimization and rigorous validation.",
        "Designed to establish a stronger standard for evaluating indicator-based trading strategies with thorough testing across parameters and conditions."
      ],
      "href": "/projects"
    },
    {
      "id": "siopa",
      "title": "SIOPA – Stock Indicator Optimization and Predictive Analysis",
      "body": [
        "A deep neural network framework to classify and predict optimal stock indicator parameters.",
        "Uses historical data and backtesting metrics (Sharpe ratio, max drawdown) to streamline parameter optimization and improve trading performance."
      ],
      "href": "/projects"
    }
  ]
}
