{
  "id": "as-md-habibullah",
  "avatar": "/avatar.jpg",
  "name": {
    "full": "As Md Habibullah",
    "sidebar": "As Md Habibullah",
    "title": "Software Engineer & PhD Student"
  },
  "bio_short": "Researcher in Biomedical Engineering at Xi’an Jiaotong University (XJTU), working on Deep Reinforcement Learning for adaptive neurofeedback and optimization; Software Engineer building production SaaS systems.",
  "bio": "I am a doctoral researcher in Biomedical Engineering at Xi’an Jiaotong University (XJTU), where my research focuses on Deep Reinforcement Learning (DRL) for adaptive neurofeedback and optimization in brain–computer interface (BCI) systems. My work investigates how learning agents can operate robustly in non-stationary, noisy, and partially observable neural environments using EEG-based feedback.\n\nIn parallel, I collaborate with Xidian University (XDU) on my previous research line in Financial Deep Reinforcement Learning, working with my former supervisor on reinforcement learning–based stock trading and portfolio optimization under non-stationary market conditions.\n\nAlongside academic research, I work as a Software Engineer at Autofficina Internazionale s.a.s, where I design and maintain production-grade SaaS systems. My work spans customer appointment management, marketing automation, dynamic content generation, URL shorteners, and vehicle telematics—driven by performance, reliability, and measurable business impact.",
  "affiliation": {
    "institution": "Xi’an Jiaotong University (XJTU)",
    "department": "PhD Student in Biomedical Engineering",
    "location": "Xi’an, China"
  },
  "contact": {
    "email": "habib@scholariest.com"
  },
  "social": {
    "github": "https://github.com/im-habib",
    "twitter": "https://twitter.com/the_habib",
    "linkedin": "https://www.linkedin.com/in/im-habib",
    "google_scholar": "https://scholar.google.com/citations?hl=en&user=NwSjZScAAAAJ"
  },
  "cv": {
    "pdf": "/resume.pdf"
  },
  "research_interests": [
    "Optimization",
    "EEG Signal Modeling",
    "Adaptive Neurofeedback",
    "Brain Network Analysis",
    "Deep Reinforcement Learning (DRL)",
    "Financial Deep Reinforcement Learning (FinDRL)"
  ]
}